In [18]:
import mysql.connector

In [19]:
try :
    conn = mysql.connector.connect(host = 'localhost', password = 'Indigostars' ,user = 'root')
    print('Connected to MySQL')
except :
    print('Connection Failed')

Connected to MySQL

In [20]:
cursor = conn.cursor(buffered = True)

In [30]:
sql  = 'use testdatabase'
cursor.execute(sql)

In [43]:
sql  = 'select * from petsale  ;'
result = cursor.execute(sql)
cursor.fetchall()

[(1, 'Cat', Decimal('450.09'), datetime.date(2018, 5, 29), 15),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [44]:
sql = """CREATE TABLE Laptop ( 
                             Id int(11) NOT NULL,
                             Name varchar(250) NOT NULL,
                             Price float NOT NULL,
                             Purchase_date Date NOT NULL,
                             PRIMARY KEY (Id)) """
result  = cursor.execute(sql)

In [46]:
sql = """ create procedure testconnected()
          begin
          select * from petsale;
          end ; """
cursor.execute(sql)

In [37]:
sql  = "select cc.CASE_NUMBER, cc.PRIMARY_TYPE, csd.COMMUNITY_AREA_NAME,cc.LOCATION_DESCRIPTION FROM chicago_crime as cc left join chicago_socioeconomic_data as csd on cc.COMMUNITY_AREA_NUMBER = csd.COMMUNITY_AREA_NUMBER where cc.LOCATION_DESCRIPTION like '%SCHOOL%';"
cursor.execute(sql)
cursor.fetchall()

[('HL353697', 'BATTERY', 'South Shore', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HL725506', 'BATTERY', 'Lincoln Square', 'SCHOOL, PUBLIC, BUILDING'),
 ('HP716225', 'BATTERY', 'Douglas', 'SCHOOL, PUBLIC, BUILDING'),
 ('HH639427', 'BATTERY', 'Austin', 'SCHOOL, PUBLIC, BUILDING'),
 ('JA460432', 'BATTERY', 'Ashburn', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HS200939', 'CRIMINAL DAMAGE', 'Austin', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HK577020', 'NARCOTICS', 'Rogers Park', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HS305355', 'NARCOTICS', 'Brighton Park', 'SCHOOL, PUBLIC, BUILDING'),
 ('HT315369', 'ASSAULT', 'East Garfield Park', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HR585012', 'CRIMINAL TRESPASS', 'Ashburn', 'SCHOOL, PUBLIC, GROUNDS'),
 ('HH292682',
  'PUBLIC PEACE VIOLATION',
  'CHICAGO',
  'SCHOOL, PRIVATE, BUILDING'),
 ('G635735', 'PUBLIC PEACE VIOLATION', 'CHICAGO', 'SCHOOL, PUBLIC, BUILDING')]

In [47]:
import pandas as pd

In [48]:
sql  = 'select * from petrescue;'
df = pd.read_sql(sql, conn)

In [49]:
df.head()

   ID  ANIMAL  QUANTITY    COST  RESCUEDATE
0   1     Cat        15  450.09  2018-05-29
1   2     Dog         3  666.66  2018-06-01
2   3     Dog         1  100.00  2018-06-04
3   4  Parrot         2   50.00  2018-06-04
4   5     Dog         1   75.75  2018-06-10

In [51]:
df.shape

(9, 5)

In [52]:
cursor.close()

True

In [55]:
conn.close()

In [54]:
conn

In [ ]:
sql  = 'select * from petsale  ;'
result = cursor.execute(sql)
cursor.fetchall()

In [57]:
df.head()

   ID  ANIMAL  QUANTITY    COST  RESCUEDATE
0   1     Cat        15  450.09  2018-05-29
1   2     Dog         3  666.66  2018-06-01
2   3     Dog         1  100.00  2018-06-04
3   4  Parrot         2   50.00  2018-06-04
4   5     Dog         1   75.75  2018-06-10

In [59]:
df[['ID']]

   ID
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9

### Thank You